// Задача 2: Задайте строку, содержащую латинские буквы
// в обоих регистрах. Сформируйте строку, в которой все
// заглавные буквы заменены на строчные. 

string str = "aS1fl13rAf1!!!;;  dsgsdgFGGvb";

Console.WriteLine(str);

Console.WriteLine(str.ToLower());

